fonecmid-diplom.Расширение/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="02ae4dca-90c9-4533-a8d2-45f7c925e1e1">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="56e1be80-538e-4a1a-bac3-d0265e273da1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7ac2c20-577c-4b41-9689-ee5f9e0b5bea">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a45cfae-866d-46e0-8b7b-cd53f207caca">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="81456f51-5c22-4e0b-93c2-ef6f998543dc">
    <name>Услуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="28f19144-e851-4054-8409-ddbcc0e4ecb2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7fab7720-d7bd-4002-8786-6ffa8c2bbaed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b517798-39a1-44eb-9dba-ffa1d1925efa">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a89a48c2-2304-4820-bd36-596a68679149">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom.Расширение/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bcf5efc-d119-4131-835d-815195fc8c51">
  <name>ВидыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
  <enumValues extendedConfigurationObject="05cf7625-5d6d-4d47-80fe-ad6a90a4e195">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom.Расширение/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	СообщОш ="";
//получит номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры,
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураАбонентскаяПлата."));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураРаботыСпециалиста."));
	КонецЕсли;
	Если ЗначениеЗаполнено(СообщОш) Тогда
		СообщОш = СтрШаблон("%1 %2", СообщОш, "Обработка отменена.");
		ОбщегоНазначения.СообщитьПользователю(СообщОш);
		Возврат;
	КонецЕсли;
//
//очистит табличную часть.
	Услуги.Очистить();
//Найти действующий договор абонентского обслуживания 
//Запрос = Новый Запрос;
//Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДК.Ссылка,
//	|	ДК.ВКМ_ДатаНачалаДоговораОбслуживания,
//	|	ДК.ВКМ_ДатаОкончанияДоговораОбслуживания,
//	|	ДК.ВКМ_СуммаЕжемесячнойАбонентскойПлаты,
//	|	ДК.ВКМ_СтоимостьЧасаРаботыСпециалиста,
//	|	ДК.Организация,
//	|	ДК.ВидДоговора,
//	|	ДК.Владелец
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДК
//	|ГДЕ
//	|	ДК.Организация = &Организация
//	|	И ДК.ВидДоговора = &ВидДоговора
//	|	И ДК.Владелец = &Контрагент
//	|	И НАЧАЛОПЕРИОДА(ДК.ВКМ_ДатаНачалаДоговораОбслуживания, месяц) <= &Дт
//	|	И КОНЕЦПЕРИОДА(ДК.ВКМ_ДатаОкончанияДоговораОбслуживания, месяц) >= &Дт";
//
//Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
//Запрос.УстановитьПараметр("Организация", Организация);
//Запрос.УстановитьПараметр("Контрагент", Контрагент);
//Запрос.УстановитьПараметр("Дт", Дата);
//
//РезультатЗапроса = Запрос.Выполнить();
//
//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//
//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
//КонецЦикла;



	СтруДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
		"ВидДоговора,ВКМ_СуммаЕжемесячнойАбонентскойПлаты,ВКМ_СтоимостьЧасаРаботыСпециалиста,ВКМ_ДатаНачалаДоговораОбслуживания,ВКМ_ДатаОкончанияДоговораОбслуживания");
	Если СтруДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
//Если в договоре ненулевая сумма абонентской платы, добавьте в табличную часть строку с номенклатурой 
//из константы НоменклатураАбонентскаяПлата и суммой абонентской платы из договора.
		Если ЗначениеЗаполнено(СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты) Тогда
			Стр = Услуги.Добавить();
			Стр.Номенклатура = НоменклатураАбонентскаяПлата;
			Стр.Количество = 1;
			Стр.Цена = СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты;
			Стр.Сумма = Стр.Количество * Стр.Цена;
		КонецЕсли; 
//
//Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация о выполненных работах 
//по этому договору, добавьте в табличную часть строку с номенклатурой из константы 
//НоменклатураРаботыСпециалиста и общим количеством и суммой из 
//регистра ВыполненныеКлиентуРаботы за месяц документа.

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_ЧасыКОплатеКлиентуПриход,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_СуммаКОплатеПриход
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(НАЧАЛОПЕРИОДА(&Дт, месяц), КОНЕЦПЕРИОДА(&Дт, месяц), Месяц,
		|		ВКМ_Организация = &Организация
		|	И ВКМ_Клиент = &Клиент
		|	И ВКМ_Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("Дт", Дата);
		Запрос.УстановитьПараметр("Клиент", Контрагент);

		РезультатЗапроса = Запрос.Выполнить();

		ВДЗ = РезультатЗапроса.Выбрать();

		Если ВДЗ.Следующий() Тогда
			Рабт = Услуги.Добавить();
			Рабт.Номенклатура = НоменклатураРаботыСпециалиста;
			Рабт.Количество = ВДЗ.ВКМ_ЧасыКОплатеКлиентуПриход;
			Рабт.Сумма = ВДЗ.ВКМ_СуммаКОплатеПриход;
			Рабт.Цена = Рабт.Сумма / Рабт.Количество;
		КонецЕсли;

	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			"В документе договор виде не Абонентского обслуживания. Обработка отменена.");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
